Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: Contact Us, Submit Bug Report, Submit Blog, and Report a Comment now fill in your email automatically when you're signed in, using your account's email instead of asking you to type it again. If you're signed out, your last-typed email is remembered locally on this device for next time. All four also now check for a properly formatted address before letting you continue.
ar: تعبئ نماذج تواصل معنا، وإرسال تقرير خطأ، وإرسال مدونة، والإبلاغ عن تعليق الآن بريدك الإلكتروني تلقائيًا عند تسجيل الدخول، باستخدام بريد حسابك بدلاً من مطالبتك بكتابته مجددًا. إذا كنت قد سجّلت الخروج، يُتذكَّر آخر بريد إلكتروني كتبته محليًا على هذا الجهاز للمرة القادمة. تتحقق النماذج الأربعة الآن أيضًا من صحة تنسيق العنوان قبل السماح لك بالمتابعة.
de: Kontakt, Fehlerbericht einreichen, Blog einreichen und Kommentar melden füllen deine E-Mail-Adresse jetzt automatisch aus, wenn du angemeldet bist – mit der E-Mail deines Kontos, statt sie erneut abzufragen. Bist du abgemeldet, wird deine zuletzt eingegebene E-Mail-Adresse lokal auf diesem Gerät für das nächste Mal gemerkt. Alle vier prüfen jetzt außerdem, ob die Adresse richtig formatiert ist, bevor du fortfahren kannst.
el: Οι φόρμες Επικοινωνία, Υποβολή αναφοράς σφάλματος, Υποβολή ανάρτησης ιστολογίου και Αναφορά σχολίου συμπληρώνουν πλέον αυτόματα το email σας όταν είστε συνδεδεμένοι, χρησιμοποιώντας το email του λογαριασμού σας αντί να σας ζητούν να το πληκτρολογήσετε ξανά. Αν είστε αποσυνδεδεμένοι, το τελευταίο email που πληκτρολογήσατε απομνημονεύεται τοπικά σε αυτή τη συσκευή για την επόμενη φορά. Και οι τέσσερις φόρμες ελέγχουν επίσης πλέον ότι η διεύθυνση έχει τη σωστή μορφή πριν σας αφήσουν να συνεχίσετε.
es: Contactar, Enviar informe de error, Enviar blog e Informar un comentario ahora completan tu correo automáticamente cuando has iniciado sesión, usando el correo de tu cuenta en lugar de pedirte que lo escribas de nuevo. Si has cerrado sesión, tu último correo escrito se recuerda localmente en este dispositivo para la próxima vez. Los cuatro también comprueban ahora que la dirección tenga un formato correcto antes de dejarte continuar.
fa: فرم‌های تماس با ما، ارسال گزارش اشکال، ارسال وبلاگ و گزارش نظر اکنون هنگام ورود شما به سیستم، ایمیل شما را به‌طور خودکار با استفاده از ایمیل حساب کاربری‌تان پر می‌کنند، به‌جای اینکه از شما بخواهند دوباره آن را تایپ کنید. اگر خارج از سیستم هستید، آخرین ایمیل تایپ‌شدهٔ شما به‌صورت محلی روی این دستگاه برای دفعهٔ بعد به خاطر سپرده می‌شود. هر چهار مورد اکنون همچنین قبل از اجازهٔ ادامه، فرمت صحیح آدرس را بررسی می‌کنند.
fr: Contacter AppleVis, Soumettre un rapport de bug, Soumettre un article de blog et Signaler un commentaire remplissent désormais automatiquement votre e-mail lorsque vous êtes connecté(e), en utilisant l'e-mail de votre compte au lieu de vous demander de le retaper. Si vous êtes déconnecté(e), votre dernier e-mail saisi est mémorisé localement sur cet appareil pour la prochaine fois. Ces quatre formulaires vérifient désormais aussi que l'adresse est correctement formatée avant de vous laisser continuer.
he: צור קשר, שלח דיווח על באג, שלח בלוג, ודווח על תגובה כעת ממלאים את האימייל שלך אוטומטית כשאתה מחובר, באמצעות האימייל של החשבון שלך במקום לבקש ממך להקליד אותו שוב. אם אתה מנותק, האימייל האחרון שהקלדת נשמר באופן מקומי במכשיר הזה לפעם הבאה. גם ארבעתם בודקים כעת שהכתובת מעוצבת כראוי לפני שממשיכים.
hi: संपर्क करें, बग रिपोर्ट सबमिट करें, ब्लॉग सबमिट करें, और टिप्पणी की रिपोर्ट करें अब साइन इन होने पर आपका ईमेल स्वचालित रूप से भर देते हैं, आपके खाते के ईमेल का उपयोग करके, इसे दोबारा टाइप करने के लिए कहने के बजाय। यदि आप साइन आउट हैं, तो आपका अंतिम टाइप किया गया ईमेल अगली बार के लिए इस डिवाइस पर स्थानीय रूप से याद रखा जाता है। चारों अब आपको आगे बढ़ने देने से पहले पते के सही फ़ॉर्मेट की भी जांच करते हैं।
id: Hubungi Kami, Kirim Laporan Bug, Kirim Blog, dan Laporkan Komentar kini otomatis mengisi email Anda saat Anda masuk, menggunakan email akun Anda alih-alih meminta Anda mengetiknya lagi. Jika Anda keluar, email terakhir yang Anda ketik akan diingat secara lokal di perangkat ini untuk lain waktu. Keempatnya kini juga memeriksa format alamat yang benar sebelum mengizinkan Anda melanjutkan.
it: Contattaci, Invia segnalazione bug, Invia blog e Segnala un commento ora compilano automaticamente la tua email quando hai eseguito l'accesso, usando l'email del tuo account invece di chiedertela di nuovo. Se hai effettuato la disconnessione, la tua ultima email digitata viene ricordata localmente su questo dispositivo per la prossima volta. Tutti e quattro ora controllano anche che l'indirizzo sia formattato correttamente prima di farti continuare.
ja: 「お問い合わせ」「不具合報告の送信」「ブログの送信」「コメントの報告」は、サインインしている場合、アカウントのメールアドレスを使って自動的にメールを入力するようになり、再入力を求めることがなくなりました。サインアウトしている場合は、最後に入力したメールアドレスがこのデバイスにローカルで記憶され、次回に使用されます。この4つはすべて、続行を許可する前にアドレスの形式が正しいかどうかもチェックするようになりました。
ko: 문의하기, 버그 보고서 제출, 블로그 제출, 댓글 신고는 이제 로그인 상태일 때 계정의 이메일을 사용하여 이메일을 자동으로 입력하며, 다시 입력하도록 요청하지 않습니다. 로그아웃 상태라면 마지막으로 입력한 이메일이 다음번을 위해 이 기기에 로컬로 저장됩니다. 네 가지 모두 이제 계속 진행하기 전에 주소 형식이 올바른지도 확인합니다.
nl: Contact opnemen, Bugrapport indienen, Blog indienen en Reactie melden vullen nu automatisch je e-mailadres in wanneer je bent ingelogd, met het e-mailadres van je account in plaats van het opnieuw te vragen. Ben je uitgelogd, dan wordt je laatst getypte e-mailadres lokaal op dit toestel onthouden voor de volgende keer. Alle vier controleren nu ook of het adres correct is opgemaakt voordat je verder kunt.
pl: Kontakt, Zgłoś błąd, Zgłoś wpis na blogu i Zgłoś komentarz automatycznie wypełniają teraz Twój e-mail, gdy jesteś zalogowany, używając e-maila z Twojego konta zamiast prosić o jego ponowne wpisanie. Jeśli jesteś wylogowany, Twój ostatnio wpisany e-mail jest zapamiętywany lokalnie na tym urządzeniu na następny raz. Wszystkie cztery formularze sprawdzają też teraz, czy adres ma prawidłowy format, zanim pozwolą Ci kontynuować.
pt: Fale Conosco, Enviar Relatório de Bug, Enviar Blog e Denunciar um Comentário agora preenchem seu e-mail automaticamente quando você está conectado, usando o e-mail da sua conta em vez de pedir que você o digite novamente. Se você estiver desconectado, o último e-mail digitado é lembrado localmente neste dispositivo para a próxima vez. Os quatro também agora verificam se o endereço está formatado corretamente antes de permitir que você continue.
ru: Связаться с нами, Отправить отчёт об ошибке, Отправить запись в блог и Пожаловаться на комментарий теперь автоматически заполняют ваш email, когда вы вошли в систему, используя email вашего аккаунта вместо повторного запроса. Если вы вышли из системы, ваш последний введённый email запоминается локально на этом устройстве для следующего раза. Все четыре формы теперь также проверяют правильность формата адреса, прежде чем позволить продолжить.
sv: Kontakta oss, Skicka felrapport, Skicka blogginlägg och Rapportera en kommentar fyller nu i din e-post automatiskt när du är inloggad, med kontots e-post istället för att be dig skriva den igen. Om du är utloggad kommer din senast skrivna e-post ihåg lokalt på den här enheten till nästa gång. Alla fyra kontrollerar nu också att adressen är korrekt formaterad innan du kan fortsätta.
th: ติดต่อเรา, ส่งรายงานข้อบกพร่อง, ส่งบล็อก และรายงานความคิดเห็น ตอนนี้จะกรอกอีเมลของคุณโดยอัตโนมัติเมื่อคุณลงชื่อเข้าใช้ โดยใช้อีเมลของบัญชีคุณแทนที่จะให้คุณพิมพ์ใหม่ หากคุณออกจากระบบ อีเมลล่าสุดที่คุณพิมพ์จะถูกจดจำไว้ในเครื่องนี้สำหรับครั้งต่อไป ทั้งสี่แบบฟอร์มยังตรวจสอบรูปแบบที่อยู่อีเมลที่ถูกต้องก่อนให้คุณดำเนินการต่อ
tr: Bize Ulaşın, Hata Bildirimi Gönder, Blog Gönder ve Yorumu Bildir artık oturum açtığınızda e-postanızı otomatik olarak dolduruyor; bunu tekrar sormak yerine hesabınızın e-postasını kullanıyor. Oturumunuz kapalıysa, en son yazdığınız e-posta bir sonraki sefer için bu cihazda yerel olarak hatırlanır. Dördü de artık devam etmenize izin vermeden önce adresin doğru biçimlendirilip biçimlendirilmediğini de kontrol ediyor.
uk: Зв'язатися з нами, Надіслати звіт про помилку, Надіслати запис у блог і Поскаржитися на коментар тепер автоматично заповнюють вашу електронну пошту, коли ви увійшли в систему, використовуючи пошту вашого акаунта замість повторного запиту. Якщо ви вийшли з системи, ваша остання введена пошта запам'ятовується локально на цьому пристрої для наступного разу. Усі чотири форми тепер також перевіряють правильність формату адреси, перш ніж дозволити продовжити.
vi: Liên hệ với chúng tôi, Gửi báo cáo lỗi, Gửi bài blog và Báo cáo bình luận giờ đây sẽ tự động điền email của bạn khi bạn đã đăng nhập, sử dụng email tài khoản của bạn thay vì yêu cầu bạn gõ lại. Nếu bạn đã đăng xuất, email bạn gõ gần nhất sẽ được ghi nhớ cục bộ trên thiết bị này cho lần sau. Cả bốn cũng hiện kiểm tra định dạng địa chỉ hợp lệ trước khi cho phép bạn tiếp tục.
zh_hans: “联系我们”“提交错误报告”“提交博客”和“举报评论”现在会在您登录时使用账户邮箱自动填写您的邮箱,而不是要求您重新输入。如果您已退出登录,您上次输入的邮箱会在此设备本地记住,供下次使用。这四项功能现在也会在允许您继续之前检查地址格式是否正确。

source: Contact Us, Submit Bug Report, Submit Blog, Report a Comment, and Change Email Address now quietly check whether the domain you typed (the part after the @) actually exists on the internet, and show a gentle "check for a typo?" note if it doesn't — entirely on-device, nothing about your address is sent anywhere to check it. It's a hint, not a lock: a slow or unusual network never blocks Send, and it can't confirm a specific inbox exists, only that the domain itself is real.
ar: تتحقق الآن نماذج تواصل معنا، وإرسال تقرير خطأ، وإرسال مدونة، والإبلاغ عن تعليق، وتغيير عنوان البريد الإلكتروني بهدوء مما إذا كان النطاق الذي كتبته (الجزء الذي يلي علامة @) موجودًا فعليًا على الإنترنت، وتعرض ملاحظة لطيفة "تحقق من وجود خطأ إملائي؟" إذا لم يكن كذلك — وذلك بالكامل على الجهاز، دون إرسال أي شيء من عنوانك إلى أي مكان للتحقق منه. إنه تلميح وليس قفلًا: فالشبكة البطيئة أو غير المعتادة لا تمنع الإرسال أبدًا، ولا يمكنه تأكيد وجود صندوق بريد معين، بل فقط أن النطاق نفسه حقيقي.
de: Kontakt, Fehlerbericht einreichen, Blog einreichen, Kommentar melden und E-Mail-Adresse ändern prüfen jetzt still im Hintergrund, ob die eingegebene Domain (der Teil nach dem @) im Internet tatsächlich existiert, und zeigen einen sanften Hinweis „auf einen Tippfehler prüfen?“, falls nicht – vollständig auf dem Gerät, ohne dass etwas von deiner Adresse zur Prüfung irgendwohin gesendet wird. Es ist ein Hinweis, keine Sperre: Eine langsame oder ungewöhnliche Verbindung blockiert Senden nie, und es kann nicht bestätigen, dass ein bestimmtes Postfach existiert – nur, dass die Domain selbst echt ist.
el: Οι φόρμες Επικοινωνία, Υποβολή αναφοράς σφάλματος, Υποβολή ανάρτησης ιστολογίου, Αναφορά σχολίου και Αλλαγή διεύθυνσης email ελέγχουν τώρα διακριτικά αν ο τομέας που πληκτρολογήσατε (το μέρος μετά το @) υπάρχει πράγματι στο διαδίκτυο, και εμφανίζουν μια ήπια σημείωση «έλεγχος για τυπογραφικό λάθος;» αν δεν υπάρχει — εξ ολοκλήρου στη συσκευή, χωρίς να αποστέλλεται πουθενά τίποτα σχετικό με τη διεύθυνσή σας για τον έλεγχο. Είναι μια υπόδειξη, όχι κλείδωμα: ένα αργό ή ασυνήθιστο δίκτυο δεν εμποδίζει ποτέ την αποστολή, και δεν μπορεί να επιβεβαιώσει ότι υπάρχει ένα συγκεκριμένο γραμματοκιβώτιο, μόνο ότι ο ίδιος ο τομέας είναι πραγματικός.
es: Contactar, Enviar informe de error, Enviar blog, Informar un comentario y Cambiar dirección de correo ahora comprueban discretamente si el dominio que escribiste (la parte después del @) realmente existe en internet, y muestran una nota discreta «¿revisar si hay un error?» si no es así, todo en el propio dispositivo, sin enviar nada de tu dirección a ningún sitio para comprobarlo. Es una pista, no un bloqueo: una red lenta o inusual nunca bloquea el envío, y no puede confirmar que exista un buzón concreto, solo que el dominio en sí es real.
fa: تماس با ما، ارسال گزارش اشکال، ارسال وبلاگ، گزارش نظر و تغییر آدرس ایمیل اکنون به‌آرامی بررسی می‌کنند که آیا دامنه‌ای که تایپ کرده‌اید (بخش بعد از @) واقعاً در اینترنت وجود دارد یا نه، و در صورت عدم وجود، یادداشتی ملایم با عنوان «غلط املایی را بررسی می‌کنید؟» نشان می‌دهند — کاملاً روی دستگاه، و هیچ چیزی از آدرس شما برای بررسی به جایی ارسال نمی‌شود. این یک راهنمایی است، نه یک قفل: شبکهٔ کند یا غیرعادی هرگز ارسال را مسدود نمی‌کند، و نمی‌تواند وجود یک صندوق پستی خاص را تأیید کند، فقط اینکه خود دامنه واقعی است.
fr: Contacter AppleVis, Soumettre un rapport de bug, Soumettre un article de blog, Signaler un commentaire et Changer l'adresse e-mail vérifient désormais discrètement si le domaine que vous avez saisi (la partie après le @) existe réellement sur Internet, et affichent une note discrète « vérifier une faute de frappe ? » si ce n'est pas le cas — entièrement sur l'appareil, rien concernant votre adresse n'est envoyé où que ce soit pour cette vérification. C'est une indication, pas un verrou : un réseau lent ou inhabituel ne bloque jamais l'envoi, et cela ne peut pas confirmer qu'une boîte de réception précise existe, seulement que le domaine lui-même est réel.
he: צור קשר, שלח דיווח על באג, שלח בלוג, דווח על תגובה, ושנה כתובת אימייל בודקים כעת בשקט אם הדומיין שהקלדת (החלק שאחרי ה-@) קיים באמת באינטרנט, ומציגים הערה עדינה "לבדוק שגיאת הקלדה?" אם לא — הכול במכשיר עצמו, שום דבר מהכתובת שלך לא נשלח לשום מקום כדי לבדוק זאת. זו רמז, לא נעילה: רשת איטית או חריגה לעולם לא חוסמת שליחה, וזה לא יכול לאשר שתיבת דואר מסוימת קיימת, רק שהדומיין עצמו אמיתי.
hi: संपर्क करें, बग रिपोर्ट सबमिट करें, ब्लॉग सबमिट करें, टिप्पणी की रिपोर्ट करें, और ईमेल पता बदलें अब चुपचाप जांचते हैं कि आपके द्वारा टाइप किया गया डोमेन (@ के बाद का भाग) वास्तव में इंटरनेट पर मौजूद है या नहीं, और यदि नहीं है तो एक हल्का नोट "टाइपो जांचें?" दिखाते हैं — पूरी तरह डिवाइस पर ही, आपके पते के बारे में कुछ भी जांच के लिए कहीं नहीं भेजा जाता। यह एक संकेत है, कोई रोक नहीं: धीमा या असामान्य नेटवर्क कभी भी भेजना नहीं रोकता, और यह किसी विशिष्ट इनबॉक्स के अस्तित्व की पुष्टि नहीं कर सकता, केवल यह कि डोमेन स्वयं वास्तविक है।
id: Hubungi Kami, Kirim Laporan Bug, Kirim Blog, Laporkan Komentar, dan Ubah Alamat Email kini diam-diam memeriksa apakah domain yang Anda ketik (bagian setelah @) benar-benar ada di internet, dan menampilkan catatan lembut "periksa salah ketik?" jika tidak — sepenuhnya di perangkat, tidak ada apa pun dari alamat Anda yang dikirim ke mana pun untuk memeriksanya. Ini petunjuk, bukan kunci: jaringan yang lambat atau tidak biasa tidak pernah memblokir Kirim, dan tidak dapat memastikan kotak masuk tertentu ada, hanya bahwa domain itu sendiri nyata.
it: Contattaci, Invia segnalazione bug, Invia blog, Segnala un commento e Cambia indirizzo email ora controllano silenziosamente se il dominio digitato (la parte dopo la @) esiste davvero su internet, mostrando una nota discreta "controlla se c'è un errore di battitura?" in caso contrario — interamente sul dispositivo, senza inviare nulla del tuo indirizzo altrove per verificarlo. È un suggerimento, non un blocco: una rete lenta o insolita non blocca mai l'invio, e non può confermare che esista una casella di posta specifica, solo che il dominio stesso è reale.
ja: 「お問い合わせ」「不具合報告の送信」「ブログの送信」「コメントの報告」「メールアドレスの変更」は、入力したドメイン(@の後ろの部分)が実際にインターネット上に存在するかを静かに確認し、存在しない場合は「入力ミスを確認しますか?」というやさしい注意を表示するようになりました — すべて端末上で完結し、確認のためにあなたのアドレスに関する情報がどこかに送信されることはありません。これはロックではなくヒントです。低速や特殊なネットワークが送信をブロックすることはなく、特定の受信箱の存在までは確認できず、ドメイン自体が実在するかどうかのみを確認します。
ko: 문의하기, 버그 보고서 제출, 블로그 제출, 댓글 신고, 이메일 주소 변경은 이제 입력한 도메인(@ 뒤 부분)이 실제로 인터넷에 존재하는지 조용히 확인하고, 존재하지 않으면 부드러운 "오타를 확인해 보시겠어요?" 메모를 표시합니다 — 모두 기기 내에서 처리되며, 확인을 위해 주소에 관한 어떤 정보도 어디로도 전송되지 않습니다. 이는 잠금이 아니라 힌트입니다. 느리거나 특이한 네트워크가 전송을 막는 일은 없으며, 특정 받은편지함이 존재하는지는 확인할 수 없고 도메인 자체가 실재하는지만 확인합니다.
nl: Contact opnemen, Bugrapport indienen, Blog indienen, Reactie melden en E-mailadres wijzigen controleren nu stilletjes of het door jou getypte domein (het deel na de @) daadwerkelijk op internet bestaat, en tonen een subtiele melding 'controleren op een typefout?' als dat niet zo is — volledig op het toestel, er wordt niets van je adres ergens naartoe gestuurd om het te controleren. Het is een hint, geen slot: een trage of ongebruikelijke netwerkverbinding blokkeert Verzenden nooit, en het kan niet bevestigen dat een specifieke inbox bestaat, alleen dat het domein zelf echt is.
pl: Kontakt, Zgłoś błąd, Zgłoś wpis na blogu, Zgłoś komentarz i Zmień adres e-mail teraz po cichu sprawdzają, czy wpisana przez Ciebie domena (część po @) faktycznie istnieje w internecie, i pokazują delikatną notatkę „sprawdzić literówkę?”, jeśli nie — całkowicie na urządzeniu, nic z Twojego adresu nie jest nigdzie wysyłane w celu sprawdzenia. To wskazówka, a nie blokada: wolna lub nietypowa sieć nigdy nie blokuje wysyłania, a to nie może potwierdzić, że konkretna skrzynka istnieje — tylko że sama domena jest prawdziwa.
pt: Fale Conosco, Enviar Relatório de Bug, Enviar Blog, Denunciar um Comentário e Alterar Endereço de E-mail agora verificam discretamente se o domínio que você digitou (a parte depois do @) realmente existe na internet, e mostram uma nota discreta "verificar se há um erro de digitação?" caso não exista — tudo no próprio dispositivo, nada do seu endereço é enviado a lugar nenhum para essa verificação. É uma dica, não um bloqueio: uma rede lenta ou incomum nunca bloqueia o envio, e não pode confirmar que uma caixa de entrada específica existe, apenas que o domínio em si é real.
ru: Связаться с нами, Отправить отчёт об ошибке, Отправить запись в блог, Пожаловаться на комментарий и Изменить адрес электронной почты теперь незаметно проверяют, действительно ли существует введённый вами домен (часть после @) в интернете, и показывают мягкое примечание «проверить на опечатку?», если нет — полностью на устройстве, ничего из вашего адреса никуда не отправляется для проверки. Это подсказка, а не блокировка: медленная или нестандартная сеть никогда не блокирует отправку, и это не может подтвердить существование конкретного почтового ящика, только то, что сам домен реален.
sv: Kontakta oss, Skicka felrapport, Skicka blogginlägg, Rapportera en kommentar och Ändra e-postadress kontrollerar nu tyst om domänen du skrev (delen efter @) verkligen finns på internet, och visar en mild notis "kontrollera om det är ett skrivfel?" om den inte gör det — helt på enheten, inget om din adress skickas någonstans för att kontrollera den. Det är en vink, inget lås: ett långsamt eller ovanligt nätverk blockerar aldrig Skicka, och det kan inte bekräfta att en specifik inkorg finns, bara att själva domänen är verklig.
th: ติดต่อเรา, ส่งรายงานข้อบกพร่อง, ส่งบล็อก, รายงานความคิดเห็น และเปลี่ยนที่อยู่อีเมล ตอนนี้จะตรวจสอบอย่างเงียบ ๆ ว่าโดเมนที่คุณพิมพ์ (ส่วนหลัง @) มีอยู่จริงบนอินเทอร์เน็ตหรือไม่ และแสดงข้อความเตือนอย่างนุ่มนวลว่า "ตรวจสอบว่าพิมพ์ผิดหรือไม่?" หากไม่มี — ทั้งหมดนี้อยู่บนอุปกรณ์เท่านั้น ไม่มีการส่งข้อมูลที่อยู่ของคุณไปที่ใดเพื่อตรวจสอบ นี่เป็นเพียงคำแนะนำ ไม่ใช่การล็อก เครือข่ายที่ช้าหรือผิดปกติจะไม่บล็อกการส่งเลย และไม่สามารถยืนยันได้ว่ากล่องจดหมายที่เจาะจงมีอยู่จริง เพียงแต่โดเมนนั้นเป็นของจริง
tr: Bize Ulaşın, Hata Bildirimi Gönder, Blog Gönder, Yorumu Bildir ve E-posta Adresini Değiştir artık yazdığınız alan adının (@ işaretinden sonraki kısım) internette gerçekten var olup olmadığını sessizce kontrol ediyor ve yoksa nazik bir "yazım hatası olabilir mi?" notu gösteriyor — tamamen cihaz üzerinde, bunu kontrol etmek için adresinizle ilgili hiçbir şey herhangi bir yere gönderilmiyor. Bu bir kilit değil, bir ipucu: yavaş veya alışılmadık bir ağ Gönder'i asla engellemez ve belirli bir gelen kutusunun var olduğunu değil, yalnızca alan adının gerçek olduğunu doğrulayabilir.
uk: Зв'язатися з нами, Надіслати звіт про помилку, Надіслати запис у блог, Поскаржитися на коментар і Змінити адресу електронної пошти тепер непомітно перевіряють, чи справді введений вами домен (частина після @) існує в інтернеті, і показують м'яку примітку «перевірити на помилку?», якщо ні — повністю на пристрої, нічого з вашої адреси нікуди не надсилається для перевірки. Це підказка, а не блокування: повільна або незвична мережа ніколи не блокує надсилання, і це не може підтвердити існування конкретної поштової скриньки, лише те, що сам домен реальний.
vi: Liên hệ với chúng tôi, Gửi báo cáo lỗi, Gửi bài blog, Báo cáo bình luận và Thay đổi địa chỉ email giờ đây âm thầm kiểm tra xem miền bạn gõ (phần sau @) có thực sự tồn tại trên internet hay không, và hiển thị ghi chú nhẹ nhàng "kiểm tra lỗi chính tả?" nếu không tồn tại — hoàn toàn trên thiết bị, không có gì về địa chỉ của bạn được gửi đi đâu để kiểm tra. Đây là một gợi ý, không phải khóa: mạng chậm hoặc bất thường không bao giờ chặn Gửi, và nó không thể xác nhận một hộp thư cụ thể tồn tại, chỉ xác nhận bản thân miền đó là có thật.
zh_hans: “联系我们”“提交错误报告”“提交博客”“举报评论”和“更改邮箱地址”现在会悄悄检查您输入的域名(@ 后面的部分)是否真的存在于互联网上,如果不存在,会显示一个温和的提示“检查一下是否有拼写错误?”——全部在设备本地完成,不会将您地址的任何信息发送到任何地方进行检查。这只是一个提示,而不是限制:缓慢或异常的网络连接不会阻止发送,而且它无法确认某个具体的邮箱是否存在,只能确认该域名本身是真实的。
